
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНаборКоманд

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьПример(Команда)
	
	ПримерКоманды = ОбновитьПримерНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОбновитьПримерНаСервере()

	ДанныеКоманды = Справочники.сп_Команды.ДанныеКоманды();
	ДанныеКоманды.Команда = Объект.Команда;
	ДанныеКоманды.НаборКоманд = Объект.НаборКоманд.Выгрузить(, "Команда").ВыгрузитьКолонку("Команда");
	
	Возврат Справочники.сп_Команды.Команда(ДанныеКоманды);

КонецФункции

#КонецОбласти
