
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПредопределенныеКоманды(Команда)
	
	ПараметрыВопроса = Новый Структура;
	ПараметрыВопроса.Вставить("ВидВопроса", "ЗаполнитьПредопределенныеКоманды");
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, ПараметрыВопроса);
	
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Продолжить выполнение операции?'"), РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    Если Параметры.ВидВопроса = "ЗаполнитьПредопределенныеКоманды" Тогда
		ЗаполнитьПредопределенныеКомандыНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПредопределенныеКомандыНаСервере()

	Справочники.сп_Команды.ЗаполнитьПредопределенныеКоманды();

КонецПроцедуры

#КонецОбласти