
&НаКлиенте
Процедура ЗаполнитьПредопределенныеСценарии(Команда)
	
	ПараметрыВопроса = Новый Структура;
	ПараметрыВопроса.Вставить("ВидВопроса", "ЗаполнитьПредопределенныеСценарии");
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, ПараметрыВопроса);
	
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Продолжить выполнение операции?'"), РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    Если Параметры.ВидВопроса = "ЗаполнитьПредопределенныеСценарии" Тогда
		ЗаполнитьПредопределенныеСценарииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПредопределенныеСценарииНаСервере()

	Справочники.сп_СценарииСборки.ЗаполнитьПредопределенныеСценарии();

КонецПроцедуры

#КонецОбласти