
#Область ОписаниеПеременных

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КопироватьДанныеФормы(Параметры.Ключ, Объект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокКонфликтов

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РазрешитьКонфликт(Команда)
	
	ТекущиеДанные = Элементы.СписокКонфликтов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФактическаяКоманда = ФактическаяКомандаGit(ПредопределенноеЗначение("Справочник.сп_Команды.Mergetool"), ТекущиеДанные.ПолноеИмяФайла);
		
	КомандаСистемы(ФактическаяКоманда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ФактическаяКомандаGit(ТекКоманда, ФайлКонфликта)
	
	ФактическаяКоманда = сп_ОбщегоНазначенияСервер.ФактическаяКоманда(ТекКоманда, Объект.Конфигурация, Объект.Программа);
	ФактическаяКоманда = СтрЗаменить(ФактическаяКоманда, "#$имя_файла_конфликта$#", ФайлКонфликта);

	Возврат ФактическаяКоманда;
	
КонецФункции

#КонецОбласти